var gameExp = {
    200: 740400000,
    201: 760500000,
    202: 780800000,
    203: 803500000,
    204: 824200000,
    205: 845000000,
    206: 866100000,
    207: 889500000,
    208: 910900000,
    209: 932500000,
    210: 1860100000,
    211: 1902600000,
    212: 1950400000,
    213: 1993600000,
    214: 2037200000,
    215: 2086100000,
    216: 2134000000,
    217: 2180100000,
    218: 2224900000,
    219: 2275500000,
    220: 2321100000,
    221: 2372400000,
    222: 2418600000,
    223: 2470700000,
    224: 2517600000,
    225: 2570400000,
    226: 2623800000,
    227: 2671700000,
    228: 2725800000,
    229: 2780200000,
    230: 2950300000,
    231: 3008000000,
    232: 3066000000,
    233: 3117800000,
    234: 3176600000,
    235: 3236000000,
    236: 3295900000,
    237: 3348800000,
    238: 3409300000,
    239: 3470100000,
    240: 3531200000,
    241: 3642200000,
    242: 3705100000,
    243: 3761000000,
    244: 3824800000,
    245: 3888900000,
    246: 3953300000,
    247: 4018200000,
    248: 4083500000,
    249: 4149200000,
    250: 4386100000,
    251: 4455300000,
    252: 4524900000,
    253: 4594900000,
    254: 4665400000,
    255: 4736000000,
    256: 4807300000,
    257: 4878800000,
    258: 4959500000,
    259: 5032100000,
    260: 7657200000,
    261: 7657200000,
    262: 7657200000,
    263: 7657200000,
    264: 7657200000,
    265: 7657200000,
    266: 7657200000,
    267: 7657200000,
    268: 7657200000,
    269: 7657200000,
    270: 7657200000,
    271: 7657200000,
    272: 7657200000,
    273: 7657200000,
    274: 7657200000,
    275: 7657200000,
    276: 7657200000,
    277: 7657200000,
    278: 7657200000,
    279: 7657200000,
    280: 7657200000,
    281: 7657200000,
    282: 7657200000,
    283: 7657200000,
    284: 7657200000,
    285: 7657200000,
    286: 7657200000,
    287: 7657200000,
    288: 7657200000,
    289: 7657200000,
    290: 7657200000,
    291: 7657200000,
    292: 7657200000,
    293: 7657200000,
    294: 7657200000,
    295: 7657200000,
    296: 7657200000,
    297: 7657200000,
    298: 7657200000,
    299: 7657200000,
    300: 7657200000
}

var reqExp = {
    200: 2207026470,
    201: 2471869646,
    202: 2768494003,
    203: 3100713283,
    204: 3472798876,
    205: 3889534741,
    206: 4356278909,
    207: 4879032378,
    208: 5464516263,
    209: 6120258214,
    210: 9792413142,
    211: 10869578587,
    212: 12065232231,
    213: 13392407776,
    214: 14865572631,
    215: 19325244420,
    216: 21064516417,
    217: 22960322894,
    218: 25026751954,
    219: 27279159629,
    220: 43646655406,
    221: 46701921284,
    222: 49971055773,
    223: 53469029677,
    224: 57211861754,
    225: 74375420280,
    226: 78094191294,
    227: 81998900858,
    228: 86098845900,
    229: 90403788195,
    230: 144646061112,
    231: 148985442945,
    232: 153455006233,
    233: 158058656419,
    234: 162800416111,
    235: 211640540944,
    236: 217989757172,
    237: 224529449887,
    238: 231265333383,
    239: 238203293384,
    240: 381125269414,
    241: 392559027496,
    242: 404335798320,
    243: 416465872269,
    244: 428959848437,
    245: 557647802968,
    246: 574377237057,
    247: 591608554168,
    248: 609356810793,
    249: 627637515116,
    250: 1004220024186,
    251: 1034346624911,
    252: 1065377023657,
    253: 1097338334367,
    254: 1130258484398,
    255: 1164166238930,
    256: 1199091226096,
    257: 1235063962878,
    258: 1272115881764,
    259: 1310279358220,
    260: 2902427248153,
    261: 2931451520634,
    262: 2960766035840,
    263: 2990373696198,
    264: 3020277433159,
    265: 3050480207490,
    266: 3080985009564,
    267: 3111794859659,
    268: 3142912808255,
    269: 3174341936337,
    270: 6412170711400,
    271: 6476292418514,
    272: 6541055342699,
    273: 6606465896125,
    274: 6672530555086,
    275: 13478511721273,
    276: 14826362893400,
    277: 16308999182740,
    278: 17939899101014,
    279: 19733889011115,
    280: 39862455802452,
    281: 43848701382697,
    282: 48233571520966,
    283: 53056928673062,
    284: 58362621540368,
    285: 117892495511543,
    286: 129681745062697,
    287: 142649919568966,
    288: 156914911525862,
    289: 172606402678448,
    290: 348664933410464,
    291: 383531426751510,
    292: 421884569426661,
    293: 464073026369327,
    294: 510480329006259,
    295: 1031170264592643,
    296: 1134287291051907,
    297: 1247716020157097,
    298: 1372487622172806,
    299: 2058731433259209
}
/*
var extreamMonsterPartExpList = [
    1.8274,
    1.8163,
    1.8052,
    1.7942,
    1.7831,
    1.7722,
    1.7613,
    1.7504,
    1.7395,
    1.7287,
    1.2632,
    1.2553,
    1.2475,
    1.2397,
    1.2319,
    0.7835,
    0.7148,
    0.6522,
    0.5951,
    0.5429,
    0.3034,
    0.2768,
    0.2526,
    0.2304,
    0.2102,
    0.1044,
    0.0953,
    0.0869,
    0.0793,
    0.0723,
    0.0359,
    0.0328,
    0.0299,
    0.0273,
    0.0249,
    0.0124,
    0.0113,
    0.0103,
    0.0094,
    0.0063
];*/

var extreamExp = {
    260 : 53038955532 ,
    261 : 53243953969 ,
    262 : 53447748478 ,
    263 : 53653284857 ,
    264 : 53854566910 ,
    265 : 54060610237 ,
    266 : 54265388973 ,
    267 : 54468857223 ,
    268 : 54670968299 ,
    269 : 54874849053 ,
    270 : 80998540426 ,
    271 : 81296898729 ,
    272 : 81599665400 ,
    273 : 81900357714 ,
    274 : 82198903908 ,
    275 : 105604139336 ,
    276 : 105978841962 ,
    277 : 106367292669 ,
    278 : 106760339550 ,
    279 : 107135283441 ,
    280 : 120942690904 ,
    281 : 121373205427 ,
    282 : 121838001661 ,
    283 : 122243163662 ,
    284 : 122678230477 ,
    285 : 123079765314 ,
    286 : 123586703044 ,
    287 : 123962780105 ,
    288 : 124433524840 ,
    289 : 124794429136 ,
    290 : 125170711094 ,
    291 : 125798307974 ,
    292 : 126143486258 ,
    293 : 126691936198 ,
    294 : 127109601922 ,
    295 : 127865112809 ,
    296 : 128174463888 ,
    297 : 128514750076 ,
    298 : 129013836484 ,
    299 : 129700080295 
}

function getExtreamExp(lvl, sunday ,event){
    var exp = extreamExp[lvl];
    var plusExp = 0;
    if (sunday == 1) {
        plusExp += Math.floor(exp * 0.5);
    }
    if (event == 1) {
        plusExp += Math.floor(exp * 0.5);
    }
    return {'exp':exp, 'plusExp': plusExp};
}

function getMonsterParkExp(lvl, sunday, event) {
    var exp, plusExp = 0;
    if (lvl >= 200 && lvl <= 209) {
        exp = 179957540;
    }
    if (lvl >= 210 && lvl <= 219) {
        exp = 642539340;
    }
    if (lvl >= 220 && lvl <= 224) {
        exp = 1237561920;
    }
    if (lvl >= 225 && lvl <= 229) {
        exp = 2241701605;
    }
    if (lvl >= 230 && lvl <= 234) {
        exp = 2724323200;
    }
    if (lvl >= 235 && lvl <= 239) {
        exp = 3145303350;
    }
    if (lvl >= 240 && lvl <= 244) {
        exp = 3630339550;
    }
    if (lvl >= 245) {
        exp = 4686646600;
    }
    plusExp = 0 //- exp;
    if (sunday == 1) {
        plusExp += Math.floor(exp * 0.5);
    }
    if (event == 1) {
        plusExp += Math.floor(exp * 0.5);
    }
    return {'exp':exp, 'plusExp': plusExp};
}
function getMonsterParkName(exp){
    if(exp == 179957540){
        return '소멸의 여로';
    }
    if(exp == 642539340){
        return '츄츄 아일랜드';
    }
    if(exp == 1237561920){
        return '레헬른';
    }
    if(exp == 2241701605){
        return '아르카나';
    }
    if(exp == 2724323200){
        return '모라스';
    }
    if(exp == 3145303350){
        return '에스페라';
    }
    if(exp == 3630339550){
        return '셀라스';
    }
    if(exp == 4686646600){
        return '문 브릿지';
    }
}

function mgExphasChg(hasSunday){
    if("풀문" == "풀문"){
        if(hasSunday) return 6;
        else return 3;
    }
    if ("그외" == "폴문"){
        return 2;
    }
}

function getDailyQuestExp(lvl){
    var exp = 0 ;
    var questBool = {
        '200' : $("#q200").prop("checked"),
        '210' : $("#q210").prop("checked"),
        '220' : $("#q220").prop("checked"),
        '225' : $("#q225").prop("checked"),
        '230' : $("#q230").prop("checked"),
        '235' : $("#q235").prop("checked"),
        '245' : $("#q245").prop("checked"),
        '250' : $("#q250").prop("checked"),
        '255' : $("#q255").prop("checked"),
        '260' : $("#q260").prop("checked"),
        '265' : $("#q265").prop("checked"),
        '270' : $("#q270").prop("checked"),
        '275' : $("#q275").prop("checked")
    }
    if (lvl == 200 && questBool['200']) {
        exp += 372966000 ;
    }
    if (lvl == 210 && questBool['210']) {
        exp += 910182000;
    }
    if (lvl == 220 && questBool['220']) {
        exp += 1635435000;
    }
    if (lvl== 225 && questBool['225']) {
        exp += 2118710025;
    }
    if (lvl == 230 && questBool['230']) {
        exp += 2333297700;
    }
    if (lvl == 235 && questBool['235']) {
        exp += 2489474700;
    }
    if (lvl == 245 && questBool['245']) {
        exp += 5598365850;
    }
    if (lvl == 250 && questBool['250']) {
        exp += 6036460000;
    }
    if (lvl == 255 && questBool['255']) {
        exp += 6391068550;
    }
    if (lvl == 260 && questBool['260']) {
        exp += 13713068400;
    }
    if (lvl == 265 && questBool['265']) {
        exp += 14350209192;
    }
    if (lvl == 270 && questBool['270']) {
        exp += 19371792600;
    }
    if (lvl == 275 && questBool['275']) {
        exp += 32127015480;
    }
    //console.log(' get getDailyQuestExp : ' + exp);
    return exp;

}

function getDailyQuestName(exp){
    if(exp == 372966000){
        return '소멸의 여로';
    }
    if(exp == 910182000){
        return '츄츄 아일랜드';
    }
    if(exp == 1635435000){
        return '레헬른';
    }
    if(exp == 2118710025){
        return '아르카나';
    }
    if(exp == 2333297700){
        return '모라스';
    }
    if(exp == 2489474700){
        return '에스페라';
    }
    if(exp == 5598365850){
        return '문 브릿지';
    }
    if(exp == 6036460000){
        return '고통의 미궁';
    }
    if(exp == 6391068550){
        return '리멘';
    }
    if(exp == 13713068400){
        return '세르니움';
    }
    if(exp == 14350209192){
        return '불타는 세르니움';
    }
    if(exp == 19371792600){
        return '호텔 아르크스';
    }
    if(exp == 32127015480){
        return '오디움';
    }
}

var monsterInfo = {
    200 : {
        "기쁨의 에르다스": {
            "level": 200,
            "exp": 98708
        },
        "분노의 에르다스": {
            "level": 201,
            "exp": 101389
        },
        "슬픔의 에르다스": {
            "level": 202,
            "exp": 104101
        },
        "즐거움의 에르다스": {
            "level": 203,
            "exp": 107125
        },
        "암석의 에르다스": {
            "level": 204,
            "exp": 109886
        },
        "화염의 에르다스": {
            "level": 205,
            "exp": 112662
        },
        "강인한 영혼의 에르다스": {
            "level": 206,
            "exp": 115470
        },
        "안식의 에르다스": {
            "level": 207,
            "exp": 120026
        }
        /*
        "아르마의 부하": {
            "level": 209,
            "exp": 124322
        },
        "숨겨진 즐거움의 에르다스": {
            "level": 209,
            "exp": 207204
        },
        "숨겨진 강인한 영혼의 에르다스": {
            "level": 209,
            "exp": 207204
        },
        "숨겨진 아르마의 부하": {
            "level": 209,
            "exp": 207204
        }
        */
    },
    205 : {
        "트라": {
            "level": 205,
            "exp": 112662
        },
        "몬토": {
            "level": 205,
            "exp": 112662
        },
        "수색형 T드론 A형": {
            "level": 206,
            "exp": 115470
        },
        "수색형 T드론 B형": {
            "level": 206,
            "exp": 115470
        },
        "전투형 T드론 A형": {
            "level": 207,
            "exp": 118578
        },
        "전투형 T드론 B형": {
            "level": 208,
            "exp": 121453
        },
        "섬멸형 T드론 A형": {
            "level": 209,
            "exp": 124322
        },
        "섬멸형 T드론 B형": {
            "level": 209,
            "exp": 124322
        }
        /*,
        "강력한 수색형 T드론 A형": {
            "level": 210,
            "exp": 248003
        },
        "강력한 수색형 T드론 B형": {
            "level": 210,
            "exp": 248003
        },
        "강력한 전투형 T드론 A형": {
            "level": 211,
            "exp": 253673
        },
        "강력한 전투형 T드론 B형": {
            "level": 212,
            "exp": 253673
        },
        "강력한 섬멸형 T드론 A형": {
            "level": 213,
            "exp": 265808
        },
        "강력한 섬멸형 T드론 B형": {
            "level": 213,
            "exp": 265808
        }
        */
    } ,
    210 : {
        "파인디어": {
            "level": 210,
            "exp": 248003
        },
        "큰뿔 파인디어": {
            "level": 211,
            "exp": 253673
        },
        "유나나": {
            "level": 210,
            "exp": 248003
        },
        "램나나": {
            "level": 210,
            "exp": 253673
        },
        "플리온": {
            "level": 212,
            "exp": 260047
        },
        "성난 플리온": {
            "level": 213,
            "exp": 265808
        },
        "설익은 울프롯": {
            "level": 212,
            "exp": 260047
        },
        "잘익은 울프롯": {
            "level": 213,
            "exp": 265808
        },
        "그린 캣피쉬": {
            "level": 214,
            "exp": 271621
        },
        "블루 캣피쉬": {
            "level": 216,
            "exp": 284043
        },
        "라이터틀": {
            "level": 215,
            "exp": 278138
        },
        "대장 라이터틀": {
            "level": 216,
            "exp": 284043
        },
        "크릴라": {
            "level": 217,
            "exp": 290679
        },
        "족장 크릴라": {
            "level": 219,
            "exp": 303394
        },
        "버샤크": {
            "level": 218,
            "exp": 296653
        }
    },
    215 : {
        "몽키록": {
            "level": 215,
            "exp": 278138
        },
        "버쉬룸": {
            "level": 216,
            "exp": 284043
        },
        "라이톤": {
            "level": 217,
            "exp": 290679
        },
        "스톤피": {
            "level": 218,
            "exp": 296653
        },
        "쿰파이더": {
            "level": 219,
            "exp": 303394
        },
        "다람뇽": {
            "level": 219,
            "exp": 303394
        }
        /*,
        "강력한 몽키록": {
            "level": 220,
            "exp": 309470
        },
        "강력한 버쉬룸": {
            "level": 220,
            "exp": 309470
        },
        "강력한 라이톤": {
            "level": 220,
            "exp": 309470
        },
        "강력한 스톤피": {
            "level": 220,
            "exp": 309470
        },
        "강력한 쿰파이더": {
            "level": 220,
            "exp": 309470
        },
        "강력한 다람뇽": {
            "level": 220,
            "exp": 309470
        } */
    },
    220 : {
        "종이봉투 뒷골목주민": {
            "level": 220,
            "exp": 309470
        },
        "나무판자 뒷골목주민": {
            "level": 221,
            "exp": 316316
        },
        "갈리나": {
            "level": 221,
            "exp": 316316
        },
        "갈루스": {
            "level": 222,
            "exp": 322473
        },
        "성난 우승접시": {
            "level": 222,
            "exp": 322473
        },
        "비뚤어진 우승접시": {
            "level": 223,
            "exp": 329417
        },
        "성난 무도회주민": {
            "level": 223,
            "exp": 329417
        },
        "광기의 무도회주민": {
            "level": 224,
            "exp": 335675
        },
        "약화된 클리너": {
            "level": 224,
            "exp": 335675
        },
        "춤추는 빨간구두": {
            "level": 225,
            "exp": 342720
        },
        "클리너": {
            "level": 226,
            "exp": 349836
        },
        "푸른 눈의 가고일": {
            "level": 227,
            "exp": 356216
        },
        "붉은 눈의 가고일": {
            "level": 228,
            "exp": 363430
        }
    },
    225 : {
        "물의 정령": {
            "level": 230,
            "exp": 393361
        },
        "햇살의 정령": {
            "level": 231,
            "exp": 401055
        },
        "흙의 정령": {
            "level": 232,
            "exp": 408778
        },
        "서리구름의 정령": {
            "level": 233,
            "exp": 415702
        },
        "번개구름의 정령": {
            "level": 238,
            "exp": 454564
        },
        "맹독의 정령": {
            "level": 239,
            "exp": 462670
        },
        "폭발의 정령": {
            "level": 240,
            "exp": 470824
        },
        "혼돈의 정령": {
            "level": 237,
            "exp": 446505
        }
    },
    230 : {
        "기억속의 제네로이드A형": {
            "level": 236,
            "exp": 439402
        },
        "기억속의 제네로이드B형": {
            "level": 236,
            "exp": 439402
        },
        "이름 모를 고양이": {
            "level": 237,
            "exp": 446505
        },
        "힘센 형님": {
            "level": 238,
            "exp": 454564
        },
        "강한 형님": {
            "level": 238,
            "exp": 454564
        },
        "푸른 그림자": {
            "level": 239,
            "exp": 462670
        },
        "실험의 부산물A": {
            "level": 241,
            "exp": 485614
        },
        "실험의 부산물B": {
            "level": 241,
            "exp": 485614
        },
        "의식에 휘말린 근위병": {
            "level": 242,
            "exp": 494006
        },
        "의식에 휘말린 망치병": {
            "level": 243,
            "exp": 501461
        },
        "의식에 휘말린 마법사": {
            "level": 244,
            "exp": 509964
        },
        "의식에 휘말린 궁병": {
            "level": 245,
            "exp": 518511
        }
    },
    235 : {
        "아투인": {
            "level": 240,
            "exp": 470824
        },
        "아투스": {
            "level": 241,
            "exp": 485614
        },
        "벨라리온": {
            "level": 242,
            "exp": 494006
        },
        "벨라리스": {
            "level": 243,
            "exp": 501461
        },
        "아라냐": {
            "level": 244,
            "exp": 509964
        },
        "아라네아": {
            "level": 245,
            "exp": 518511
        },
        "빛의 주시자": {
            "level": 246,
            "exp": 527106
        },
        "어둠의 주시자": {
            "level": 249,
            "exp": 553217
        },
        "빛의 집행자": {
            "level": 248,
            "exp": 544459
        }
    },
    245 : {
        "혼돈의 피조물": {
            "level": 250,
            "exp": 584807
        },
        "파괴의 피조물": {
            "level": 251,
            "exp": 594040
        },
        "엄습하는 공포": {
            "level": 252,
            "exp": 603318
        },
        "주시하는 공포": {
            "level": 253,
            "exp": 612643
        },
        "공허의 하수인": {
            "level": 254,
            "exp": 622041
        },
        "황혼의 하수인": {
            "level": 254,
            "exp": 622041
        }
    },
    250 : {
        "뒤엉킨 파편": {
            "level": 255,
            "exp": 631458
        },
        "복종하는 파편": {
            "level": 255,
            "exp": 631458
        },
        "어둠의 실패자": {
            "level": 256,
            "exp": 640971
        },
        "어둠의 피조물": {
            "level": 256,
            "exp": 640971
        },
        "절망의 날개": {
            "level": 257,
            "exp": 650504
        },
        "절망의 칼날": {
            "level": 257,
            "exp": 650504
        },
        "침묵의 기사": {
            "level": 258,
            "exp": 661261
        },
        "침묵의 정찰자": {
            "level": 258,
            "exp": 661261
        },
        "침묵의 방랑자": {
            "level": 258,
            "exp": 661261
        },
        "침묵의 감시자": {
            "level": 259,
            "exp": 670940
        },
        "침묵의 암살자": {
            "level": 259,
            "exp": 670940
        },
        "절망에 빠진 자": {
            "level": 259,
            "exp": 670940
        },
        "절망에 매인 자": {
            "level": 259,
            "exp": 670940
        }
    },
    255 : {
        "안세스티온": {
            "level": 260,
            "exp": 680638
        },
        "트랜센디온": {
            "level": 261,
            "exp": 690432
        },
        "어센시온": {
            "level": 262,
            "exp": 700242
        },
        "포어베리온": {
            "level": 263,
            "exp": 710121
        },
        "엠브리온": {
            "level": 264,
            "exp": 721247
        }/*,
        "강력한 어센시온": {
            "level": 262,
            "exp": 840290
        },
        "강력한 포어베리온": {
            "level": 263,
            "exp": 852145
        },
        "강력한 엠브리온": {
            "level": 264,
            "exp": 865496
        }*/
    },
    260 : {
        "흑태양 보병": {
            "level": 260,
            "exp": 1725461
        },
        "흑태양 궁병": {
            "level": 260,
            "exp": 1725461
        },
        "괴물 갈매기": {
            "level": 261,
            "exp": 1750290
        },
        "화염 정령": {
            "level": 262,
            "exp": 1775159
        },
        "유령 들린 서적": {
            "level": 260,
            "exp": 1725461
        },
        "떠도는 학자 유령": {
            "level": 263,
            "exp": 1800203
        },
        "호기심 많은 학자 유령": {
            "level": 264,
            "exp": 1828409
        }
    },
    265 : {
        "분노한 화염 정령": {
            "level": 265,
            "exp": 2056974
        },
        "레프 보병": {
            "level": 265,
            "exp": 2056974
        },
        "레프 법사": {
            "level": 265,
            "exp": 2056974
        },
        "레프 암살자": {
            "level": 266,
            "exp": 2085219
        },
        "레프 기갑병": {
            "level": 267,
            "exp": 2113572
        },
        "불타는 서적": {
            "level": 265,
            "exp": 2056974
        },
        "흑태양 폭탄병": {
            "level": 268,
            "exp": 2145596
        },
        "흑태양 법사": {
            "level": 269,
            "exp": 2174274
        }
    },
    270 : {
        "모래칼날 약탈꾼": {
            "level": 270,
            "exp": 2274336
        },
        "무쇠탄환 학살꾼": {
            "level": 270,
            "exp": 2274336
        },
        "탐색하는 폭실리언": {
            "level": 271,
            "exp": 2382248
        },
        "고물수집가 폭실리언": {
            "level": 272,
            "exp": 2413256
        },
        "엄격한 역무원": {
            "level": 273,
            "exp": 2546149
        },
        "주인잃은 왓치독": {
            "level": 274,
            "exp": 2582906
        }
    },
    275 : {
        "강화형 파수꾼 산호": {
            "level": 275,
            "exp": 2903024
        },
        "강화형 파수꾼 감람": {
            "level": 275,
            "exp": 2903024
        },
        "강화형 파수꾼 금강": {
            "level": 275,
            "exp": 2903024
        },
        "앵글러 로봇 A형": {
            "level": 276,
            "exp": 2939616
        },
        "앵글러 로봇 B형": {
            "level": 276,
            "exp": 2939616
        },
        "앵글러 로봇 C형": {
            "level": 276,
            "exp": 2939616
        },
        "경비병 강옥": {
            "level": 277,
            "exp": 2981010
        },
        "경비병 마노": {
            "level": 277,
            "exp": 2981010
        },
        "무너지는 실험체": {
            "level": 278,
            "exp": 3017988
        },
        "실패한 실험체": {
            "level": 279,
            "exp": 3059716
        }
    }
}

var monsterInfo2 = {
        "기쁨의 에르다스": {
            "level": 200,
            "exp": 98708
        },
        "분노의 에르다스": {
            "level": 201,
            "exp": 101389
        },
        "슬픔의 에르다스": {
            "level": 202,
            "exp": 104101
        },
        "즐거움의 에르다스": {
            "level": 203,
            "exp": 107125
        },
        "암석의 에르다스": {
            "level": 204,
            "exp": 109886
        },
        "화염의 에르다스": {
            "level": 205,
            "exp": 112662
        },
        "강인한 영혼의 에르다스": {
            "level": 206,
            "exp": 115470
        },
        "안식의 에르다스": {
            "level": 207,
            "exp": 120026
        },
        "아르마의 부하": {
            "level": 209,
            "exp": 124322
        },
        "숨겨진 즐거움의 에르다스": {
            "level": 209,
            "exp": 207204
        },
        "숨겨진 강인한 영혼의 에르다스": {
            "level": 209,
            "exp": 207204
        },
        "숨겨진 아르마의 부하": {
            "level": 209,
            "exp": 207204
        },
        "트라": {
            "level": 205,
            "exp": 112662
        },
        "몬토": {
            "level": 205,
            "exp": 112662
        },
        "수색형 T드론 A형": {
            "level": 206,
            "exp": 115470
        },
        "수색형 T드론 B형": {
            "level": 206,
            "exp": 115470
        },
        "전투형 T드론 A형": {
            "level": 207,
            "exp": 118578
        },
        "전투형 T드론 B형": {
            "level": 208,
            "exp": 121453
        },
        "섬멸형 T드론 A형": {
            "level": 209,
            "exp": 124322
        },
        "섬멸형 T드론 B형": {
            "level": 209,
            "exp": 124322
        },
        "강력한 수색형 T드론 A형": {
            "level": 210,
            "exp": 248003
        },
        "강력한 수색형 T드론 B형": {
            "level": 210,
            "exp": 248003
        },
        "강력한 전투형 T드론 A형": {
            "level": 211,
            "exp": 253673
        },
        "강력한 전투형 T드론 B형": {
            "level": 212,
            "exp": 253673
        },
        "강력한 섬멸형 T드론 A형": {
            "level": 213,
            "exp": 265808
        },
        "강력한 섬멸형 T드론 B형": {
            "level": 213,
            "exp": 265808
        },
        "파인디어": {
            "level": 210,
            "exp": 248003
        },
        "큰뿔 파인디어": {
            "level": 211,
            "exp": 253673
        },
        "유나나": {
            "level": 210,
            "exp": 248003
        },
        "램나나": {
            "level": 210,
            "exp": 253673
        },
        "플리온": {
            "level": 212,
            "exp": 260047
        },
        "성난 플리온": {
            "level": 213,
            "exp": 265808
        },
        "설익은 울프롯": {
            "level": 212,
            "exp": 260047
        },
        "잘익은 울프롯": {
            "level": 213,
            "exp": 265808
        },
        "그린 캣피쉬": {
            "level": 214,
            "exp": 271621
        },
        "블루 캣피쉬": {
            "level": 216,
            "exp": 284043
        },
        "라이터틀": {
            "level": 215,
            "exp": 278138
        },
        "대장 라이터틀": {
            "level": 216,
            "exp": 284043
        },
        "크릴라": {
            "level": 217,
            "exp": 290679
        },
        "족장 크릴라": {
            "level": 219,
            "exp": 303394
        },
        "버샤크": {
            "level": 218,
            "exp": 296653
        },
        "몽키록": {
            "level": 215,
            "exp": 278138
        },
        "버쉬룸": {
            "level": 216,
            "exp": 284043
        },
        "라이톤": {
            "level": 217,
            "exp": 290679
        },
        "스톤피": {
            "level": 218,
            "exp": 296653
        },
        "쿰파이더": {
            "level": 219,
            "exp": 303394
        },
        "다람뇽": {
            "level": 219,
            "exp": 303394
        },
        "강력한 몽키록": {
            "level": 220,
            "exp": 309470
        },
        "강력한 버쉬룸": {
            "level": 220,
            "exp": 309470
        },
        "강력한 라이톤": {
            "level": 220,
            "exp": 309470
        },
        "강력한 스톤피": {
            "level": 220,
            "exp": 309470
        },
        "강력한 쿰파이더": {
            "level": 220,
            "exp": 309470
        },
        "강력한 다람뇽": {
            "level": 220,
            "exp": 309470
        },
        "종이봉투 뒷골목주민": {
            "level": 220,
            "exp": 309470
        },
        "나무판자 뒷골목주민": {
            "level": 221,
            "exp": 316316
        },
        "갈리나": {
            "level": 221,
            "exp": 316316
        },
        "갈루스": {
            "level": 222,
            "exp": 322473
        },
        "성난 우승접시": {
            "level": 222,
            "exp": 322473
        },
        "비뚤어진 우승접시": {
            "level": 223,
            "exp": 329417
        },
        "성난 무도회주민": {
            "level": 223,
            "exp": 329417
        },
        "광기의 무도회주민": {
            "level": 224,
            "exp": 335675
        },
        "약화된 클리너": {
            "level": 224,
            "exp": 335675
        },
        "춤추는 빨간구두": {
            "level": 225,
            "exp": 342720
        },
        "클리너": {
            "level": 226,
            "exp": 349836
        },
        "푸른 눈의 가고일": {
            "level": 227,
            "exp": 356216
        },
        "붉은 눈의 가고일": {
            "level": 228,
            "exp": 363430
        },
        "물의 정령": {
            "level": 230,
            "exp": 393361
        },
        "햇살의 정령": {
            "level": 231,
            "exp": 401055
        },
        "흙의 정령": {
            "level": 232,
            "exp": 408778
        },
        "서리구름의 정령": {
            "level": 233,
            "exp": 415702
        },
        "번개구름의 정령": {
            "level": 238,
            "exp": 454564
        },
        "맹독의 정령": {
            "level": 239,
            "exp": 462670
        },
        "폭발의 정령": {
            "level": 240,
            "exp": 470824
        },
        "혼돈의 정령": {
            "level": 237,
            "exp": 446505
        },
        "기억속의 제네로이드A형": {
            "level": 236,
            "exp": 439402
        },
        "기억속의 제네로이드B형": {
            "level": 236,
            "exp": 439402
        },
        "이름 모를 고양이": {
            "level": 237,
            "exp": 446505
        },
        "힘센 형님": {
            "level": 238,
            "exp": 454564
        },
        "강한 형님": {
            "level": 238,
            "exp": 454564
        },
        "푸른 그림자": {
            "level": 239,
            "exp": 462670
        },
        "실험의 부산물A": {
            "level": 241,
            "exp": 485614
        },
        "실험의 부산물B": {
            "level": 241,
            "exp": 485614
        },
        "의식에 휘말린 근위병": {
            "level": 242,
            "exp": 494006
        },
        "의식에 휘말린 망치병": {
            "level": 243,
            "exp": 501461
        },
        "의식에 휘말린 마법사": {
            "level": 244,
            "exp": 509964
        },
        "의식에 휘말린 궁병": {
            "level": 245,
            "exp": 518511
        },
        "아투인": {
            "level": 240,
            "exp": 470824
        },
        "아투스": {
            "level": 241,
            "exp": 485614
        },
        "벨라리온": {
            "level": 242,
            "exp": 494006
        },
        "벨라리스": {
            "level": 243,
            "exp": 501461
        },
        "아라냐": {
            "level": 244,
            "exp": 509964
        },
        "아라네아": {
            "level": 245,
            "exp": 518511
        },
        "빛의 주시자": {
            "level": 246,
            "exp": 527106
        },
        "어둠의 주시자": {
            "level": 249,
            "exp": 553217
        },
        "빛의 집행자": {
            "level": 248,
            "exp": 544459
        },
        "혼돈의 피조물": {
            "level": 250,
            "exp": 584807
        },
        "파괴의 피조물": {
            "level": 251,
            "exp": 594040
        },
        "엄습하는 공포": {
            "level": 252,
            "exp": 603318
        },
        "주시하는 공포": {
            "level": 253,
            "exp": 612643
        },
        "공허의 하수인": {
            "level": 254,
            "exp": 622041
        },
        "황혼의 하수인": {
            "level": 254,
            "exp": 622041
        },
        "뒤엉킨 파편": {
            "level": 255,
            "exp": 631458
        },
        "복종하는 파편": {
            "level": 255,
            "exp": 631458
        },
        "어둠의 실패자": {
            "level": 256,
            "exp": 640971
        },
        "어둠의 피조물": {
            "level": 256,
            "exp": 640971
        },
        "절망의 날개": {
            "level": 257,
            "exp": 650504
        },
        "절망의 칼날": {
            "level": 257,
            "exp": 650504
        },
        "침묵의 기사": {
            "level": 258,
            "exp": 661261
        },
        "침묵의 정찰자": {
            "level": 258,
            "exp": 661261
        },
        "침묵의 방랑자": {
            "level": 258,
            "exp": 661261
        },
        "침묵의 감시자": {
            "level": 259,
            "exp": 670940
        },
        "침묵의 암살자": {
            "level": 259,
            "exp": 670940
        },
        "절망에 빠진 자": {
            "level": 259,
            "exp": 670940
        },
        "절망에 매인 자": {
            "level": 259,
            "exp": 670940
        },
        "안세스티온": {
            "level": 260,
            "exp": 680638
        },
        "트랜센디온": {
            "level": 261,
            "exp": 690432
        },
        "어센시온": {
            "level": 262,
            "exp": 700242
        },
        "포어베리온": {
            "level": 263,
            "exp": 710121
        },
        "엠브리온": {
            "level": 264,
            "exp": 721247
        },
        "강력한 어센시온": {
            "level": 262,
            "exp": 840290
        },
        "강력한 포어베리온": {
            "level": 263,
            "exp": 852145
        },
        "강력한 엠브리온": {
            "level": 264,
            "exp": 865496
        },
        "흑태양 보병": {
            "level": 260,
            "exp": 1725461
        },
        "흑태양 궁병": {
            "level": 260,
            "exp": 1725461
        },
        "괴물 갈매기": {
            "level": 261,
            "exp": 1750290
        },
        "화염 정령": {
            "level": 262,
            "exp": 1775159
        },
        "유령 들린 서적": {
            "level": 260,
            "exp": 1725461
        },
        "떠도는 학자 유령": {
            "level": 263,
            "exp": 1800203
        },
        "호기심 많은 학자 유령": {
            "level": 264,
            "exp": 1828409
        },
        "분노한 화염 정령": {
            "level": 265,
            "exp": 2056974
        },
        "레프 보병": {
            "level": 265,
            "exp": 2056974
        },
        "레프 법사": {
            "level": 265,
            "exp": 2056974
        },
        "레프 암살자": {
            "level": 266,
            "exp": 2085219
        },
        "레프 기갑병": {
            "level": 267,
            "exp": 2113572
        },
        "불타는 서적": {
            "level": 265,
            "exp": 2056974
        },
        "흑태양 폭탄병": {
            "level": 268,
            "exp": 2145596
        },
        "흑태양 법사": {
            "level": 269,
            "exp": 2174274
        },
        "모래칼날 약탈꾼": {
            "level": 270,
            "exp": 2274336
        },
        "무쇠탄환 학살꾼": {
            "level": 270,
            "exp": 2274336
        },
        "탐색하는 폭실리언": {
            "level": 271,
            "exp": 2382248
        },
        "고물수집가 폭실리언": {
            "level": 272,
            "exp": 2413256
        },
        "엄격한 역무원": {
            "level": 273,
            "exp": 2546149
        },
        "주인잃은 왓치독": {
            "level": 274,
            "exp": 2582906
        },
        "강화형 파수꾼 산호": {
            "level": 275,
            "exp": 2903024
        },
        "강화형 파수꾼 감람": {
            "level": 275,
            "exp": 2903024
        },
        "강화형 파수꾼 금강": {
            "level": 275,
            "exp": 2903024
        },
        "앵글러 로봇 A형": {
            "level": 276,
            "exp": 2939616
        },
        "앵글러 로봇 B형": {
            "level": 276,
            "exp": 2939616
        },
        "앵글러 로봇 C형": {
            "level": 276,
            "exp": 2939616
        },
        "경비병 강옥": {
            "level": 277,
            "exp": 2981010
        },
        "경비병 마노": {
            "level": 277,
            "exp": 2981010
        },
        "무너지는 실험체": {
            "level": 278,
            "exp": 3017988
        },
        "실패한 실험체": {
            "level": 279,
            "exp": 3059716
        }

}

